In [2]:
import numpy as np
import pandas as pd

In [6]:
abbrevs = pd.read_csv("state-abbrevs.csv")
areas = pd.read_csv("state-areas.csv")
population = pd.read_csv("state-population.csv")

In [10]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [13]:
population.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [31]:
merged  = pd.merge(population, abbrevs, left_on="state/region", right_on="abbreviation")
print(merged)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
2              AL  under18  2010   1130966.0  Alabama           AL
3              AL    total  2010   4785570.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
...           ...      ...   ...         ...      ...          ...
2443           WY  under18  1993    137458.0  Wyoming           WY
2444           WY    total  1991    459260.0  Wyoming           WY
2445           WY  under18  1991    136720.0  Wyoming           WY
2446           WY  under18  1990    136078.0  Wyoming           WY
2447           WY    total  1990    453690.0  Wyoming           WY

[2448 rows x 6 columns]

In [33]:
# check if any column contains null data
merged.isnull().any()

state/region    False
ages            False
year            False
population      False
state           False
abbreviation    False
dtype: bool

In [61]:
# Retrieving all records greater than 2010
allYearAfter2010 = merged[merged["year"] > 2010]

In [63]:
print(allYearAfter2010)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
5              AL    total  2011   4801627.0  Alabama           AL
8              AL  under18  2013   1111481.0  Alabama           AL
...           ...      ...   ...         ...      ...          ...
2401           WY  under18  2012    136526.0  Wyoming           WY
2402           WY    total  2011    567329.0  Wyoming           WY
2403           WY  under18  2011    135407.0  Wyoming           WY
2408           WY    total  2013    582658.0  Wyoming           WY
2409           WY  under18  2013    137679.0  Wyoming           WY

[306 rows x 6 columns]

In [65]:
print(f"The number of records for greater than 2010 is {len(allYearAfter2010)}")

The number of records for greater than 2010 is 306

In [87]:
# Retrieving all records greater than 2010 and from Alabama states only
allYearAfter2010Ala = merged[(merged["year"] > 2010) & (merged["state"] == 'Alabama')]

In [89]:
print(allYearAfter2010Ala)

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL
5           AL    total  2011   4801627.0  Alabama           AL
8           AL  under18  2013   1111481.0  Alabama           AL
9           AL    total  2013   4833722.0  Alabama           AL

In [99]:
# Retrieving all records greater than 2010 and from Alabama & Wyoming states only
allYearAfter2010AlaAndWyo = merged[(merged["year"] > 2010) & ((merged["state"] == 'Alabama') | (merged["state"] == 'Wyoming'))]

In [101]:
print(allYearAfter2010AlaAndWyo)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
5              AL    total  2011   4801627.0  Alabama           AL
8              AL  under18  2013   1111481.0  Alabama           AL
9              AL    total  2013   4833722.0  Alabama           AL
2400           WY    total  2012    576626.0  Wyoming           WY
2401           WY  under18  2012    136526.0  Wyoming           WY
2402           WY    total  2011    567329.0  Wyoming           WY
2403           WY  under18  2011    135407.0  Wyoming           WY
2408           WY    total  2013    582658.0  Wyoming           WY
2409           WY  under18  2013    137679.0  Wyoming           WY

In [103]:
print(len(allYearAfter2010AlaAndWyo))

12

In [119]:
# Retrieving all records greater than 2010 and from Alabama & Wyoming states only with the Year, Population and state only
records2010AlaAndWyo = merged[(merged["year"] > 2010) & ((merged["state"] == 'Alabama') | (merged["state"] == 'Wyoming'))].iloc[:,1:4]

In [121]:
print(records2010AlaAndWyo)

         ages  year  population
0     under18  2012   1117489.0
1       total  2012   4817528.0
4     under18  2011   1125763.0
5       total  2011   4801627.0
8     under18  2013   1111481.0
9       total  2013   4833722.0
2400    total  2012    576626.0
2401  under18  2012    136526.0
2402    total  2011    567329.0
2403  under18  2011    135407.0
2408    total  2013    582658.0
2409  under18  2013    137679.0

In [140]:
# Retrieving the sum of the population as from year 2010 and from Alabama & Wyoming states
averagePopAlaWyom = merged[(merged["year"] > 2010) & ((merged["state"] == 'Alabama') | (merged["state"] == 'Wyoming'))].iloc[:,3].mean()

In [142]:
print(f"The average population for Alabama and Wyoming as from Year 2010 is {averagePopAlaWyom}")

The average population for Alabama and Wyoming as from Year 2010 is 1661986.25

In [158]:
# We can also use query to perform search
usingQuery = merged.query("year > 2010")

In [160]:
print(usingQuery)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
5              AL    total  2011   4801627.0  Alabama           AL
8              AL  under18  2013   1111481.0  Alabama           AL
...           ...      ...   ...         ...      ...          ...
2401           WY  under18  2012    136526.0  Wyoming           WY
2402           WY    total  2011    567329.0  Wyoming           WY
2403           WY  under18  2011    135407.0  Wyoming           WY
2408           WY    total  2013    582658.0  Wyoming           WY
2409           WY  under18  2013    137679.0  Wyoming           WY

[306 rows x 6 columns]

In [162]:
# We can also use query to perform search...get the last records
usingQueryTail = merged.query("year > 2010").tail()
print(usingQueryTail)

     state/region     ages  year  population    state abbreviation
2401           WY  under18  2012    136526.0  Wyoming           WY
2402           WY    total  2011    567329.0  Wyoming           WY
2403           WY  under18  2011    135407.0  Wyoming           WY
2408           WY    total  2013    582658.0  Wyoming           WY
2409           WY  under18  2013    137679.0  Wyoming           WY

In [164]:
import seaborn as sns
planets = sns.load_dataset('planets') 
planets.shape

(1035, 6)

In [166]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [168]:
planets.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [188]:
# Retrieving the first set of head and tail records
pd.concat([planets.head(), planets.tail()])

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

In [193]:
# Give a full description of all columns
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [205]:
# Calculate the mean distance 
planets["distance"].mean()

264.06928217821786

In [221]:
print(planets.groupby("method").mean())

                                 number  orbital_period      mass  \
method
Astrometry                     1.000000      631.180000       NaN
Eclipse Timing Variations      1.666667     4751.644444  5.125000
Imaging                        1.315789   118247.737500       NaN
Microlensing                   1.173913     3153.571429       NaN
Orbital Brightness Modulation  1.666667        0.709307       NaN
Pulsar Timing                  2.200000     7343.021201       NaN
Pulsation Timing Variations    1.000000     1170.000000       NaN
Radial Velocity                1.721519      823.354680  2.630699
Transit                        1.954660       21.102073  1.470000
Transit Timing Variations      2.250000       79.783500       NaN

                                  distance         year
method
Astrometry                       17.875000  2011.500000
Eclipse Timing Variations       315.360000  2010.000000
Imaging                          67.715937  2009.131579
Microlensing                   4144.000000  2009.782609
Orbital Brightness Modulation  1180.000000  2011.666667
Pulsar Timing                  1200.000000  1998.400000
Pulsation Timing Variations            NaN  2007.000000
Radial Velocity                  51.600208  2007.518987
Transit                         599.298080  2011.236776
Transit Timing Variations      1104.333333  2012.500000

In [227]:
# Retrieving only the mass and distance columns
print(planets.groupby("method").mean().loc[:, ["mass","distance"]])

                                   mass     distance
method
Astrometry                          NaN    17.875000
Eclipse Timing Variations      5.125000   315.360000
Imaging                             NaN    67.715937
Microlensing                        NaN  4144.000000
Orbital Brightness Modulation       NaN  1180.000000
Pulsar Timing                       NaN  1200.000000
Pulsation Timing Variations         NaN          NaN
Radial Velocity                2.630699    51.600208
Transit                        1.470000   599.298080
Transit Timing Variations           NaN  1104.333333

In [237]:
# get the mean of distance for all methods
print(planets.groupby("method")["distance"].mean())

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

In [241]:
# Let us say we want to apply a given function to all the distance (ex multiply by 2 and add to 100
# then we can use lambda
print(planets.groupby("method")["distance"].mean().transform(lambda x: (x*2) + 100))

method
Astrometry                        135.750000
Eclipse Timing Variations         730.720000
Imaging                           235.431875
Microlensing                     8388.000000
Orbital Brightness Modulation    2460.000000
Pulsar Timing                    2500.000000
Pulsation Timing Variations              NaN
Radial Velocity                   203.200415
Transit                          1298.596161
Transit Timing Variations        2308.666667
Name: distance, dtype: float64

In [261]:
# if the lambda function to be applied is more complex then we can simply write a function
# for example, adding a given if 

def logic(x):
    if x < 100:
        return (x * 2) + 100
    else:
        return x * 2

print(planets.groupby("method")["distance"].mean().apply(logic))

method
Astrometry                        135.750000
Eclipse Timing Variations         630.720000
Imaging                           235.431875
Microlensing                     8288.000000
Orbital Brightness Modulation    2360.000000
Pulsar Timing                    2400.000000
Pulsation Timing Variations              NaN
Radial Velocity                   203.200415
Transit                          1198.596161
Transit Timing Variations        2208.666667
Name: distance, dtype: float64

In [263]:
# Using the previous example by filling null values by 0
print(planets.groupby("method")["distance"].mean().apply(logic).fillna(0))

method
Astrometry                        135.750000
Eclipse Timing Variations         630.720000
Imaging                           235.431875
Microlensing                     8288.000000
Orbital Brightness Modulation    2360.000000
Pulsar Timing                    2400.000000
Pulsation Timing Variations         0.000000
Radial Velocity                   203.200415
Transit                          1198.596161
Transit Timing Variations        2208.666667
Name: distance, dtype: float64

In [265]:
decade = 10 * (planets['year'] // 10)
print(decade)

0       2000
1       2000
2       2010
3       2000
4       2000
        ...
1030    2000
1031    2000
1032    2000
1033    2000
1034    2000
Name: year, Length: 1035, dtype: int64